In [2]:
!pip install ipython-sql
!pip install mysqlclient

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (2.1.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (5.5.0)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (1.0.18)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (4.6.4)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.5.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.7.4.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql) (0.7.0)
Collecting mysqlclient
  Downloading mysqlclient-2.0.3.tar.gz (88 kB)
     |████████████████████████████████| 88 kB 4.1 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.0.3-cp37-cp37m-linux_x86_64.whl size=100155 sha256=40c99a09ccfb59f5f095b7432155a0cd0eb5bb44adccd42e95f41d7261d17529
  Stored in directory: /root/.cache/pip/wheels/79/1c/f8/11fafab45fe6696eea63794a5d747b9c6b54990ac6f1885fb7
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [3]:
%load_ext sql

In [4]:
%sql mysql://badmstudent:badmstudent@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales

'Connected: badmstudent@sales'

In [5]:
%%sql
use sales;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
0 rows affected.

[]

In [37]:
%%sql
select * from CUSTOMER;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
10 rows affected.

[(10010, 'Ramas', 'Alfred', 'A', '615', '844-2573', 0.0),
 (10011, 'Dunne', 'Leona', 'K', '713', '894-1238', 0.0),
 (10012, 'Smith', 'Kathy', 'W', '615', '894-2285', 345.86),
 (10013, 'Olowski', 'Paul', 'F', '615', '894-2180', 536.75),
 (10014, 'Orlando', 'Myron', '', '615', '222-1672', 0.0),
 (10015, "O'Brian", 'Amy', 'B', '713', '442-3381', 0.0),
 (10016, 'Brown', 'James', 'G', '615', '297-1228', 221.19),
 (10017, 'Williams', 'George', '', '615', '290-2556', 768.93),
 (10018, 'Farriss', 'Anne', 'G', '713', '382-7185', 216.55),
 (10019, 'Smith', 'Olette', 'K', '615', '297-3809', 0.0)]

1. Display the customer name(first name and last name), invoice number(s), and total invoice value(display in 2 decimal places) for each invoice. Your output may list the same customer multiple times if the customer has multiple invoices.

In [51]:
%%sql
select C.CUS_CODE, C.CUS_LNAME, C.CUS_FNAME, I.INV_NUMBER, sum(L.LINE_UNITS*L.LINE_PRICE) as TOTAL from CUSTOMER C
inner join INVOICE I on C.CUS_CODE = I.CUS_CODE
inner join LINE L on I.INV_NUMBER = L.INV_NUMBER
group by INV_NUMBER;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
8 rows affected.

[(10014, 'Orlando', 'Myron', 1001, Decimal('24.94')),
 (10011, 'Dunne', 'Leona', 1002, Decimal('9.98')),
 (10012, 'Smith', 'Kathy', 1003, Decimal('153.85')),
 (10011, 'Dunne', 'Leona', 1004, Decimal('34.87')),
 (10018, 'Farriss', 'Anne', 1005, Decimal('70.44')),
 (10014, 'Orlando', 'Myron', 1006, Decimal('397.83')),
 (10015, "O'Brian", 'Amy', 1007, Decimal('34.97')),
 (10011, 'Dunne', 'Leona', 1008, Decimal('399.15'))]

2. Display invoice numbers that have more than two products listed on them. Each invoice (INVOICE table) has multiple lines (LINE table), and each line has information about a single product ordered.

In [55]:
%%sql
select C.CUS_CODE, C.CUS_LNAME, C.CUS_FNAME, I.INV_NUMBER, count(I.INV_NUMBER) as LINES_NUMBER, L.LINE_UNITS, L.LINE_PRICE from CUSTOMER C
inner join INVOICE I on C.CUS_CODE = I.CUS_CODE
inner join LINE L on I.INV_NUMBER = L.INV_NUMBER
group by INV_NUMBER
having LINES_NUMBER > 1;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
6 rows affected.

[(10014, 'Orlando', 'Myron', 1001, 2, 1, Decimal('14.99')),
 (10012, 'Smith', 'Kathy', 1003, 3, 1, Decimal('38.95')),
 (10011, 'Dunne', 'Leona', 1004, 2, 3, Decimal('4.99')),
 (10014, 'Orlando', 'Myron', 1006, 4, 3, Decimal('6.99')),
 (10015, "O'Brian", 'Amy', 1007, 2, 2, Decimal('14.99')),
 (10011, 'Dunne', 'Leona', 1008, 3, 5, Decimal('5.87'))]

In [56]:
%%sql
select I.INV_NUMBER, count(I.INV_NUMBER) as LINES_NUMBER from CUSTOMER C
inner join INVOICE I on C.CUS_CODE = I.CUS_CODE
inner join LINE L on I.INV_NUMBER = L.INV_NUMBER
group by INV_NUMBER
having LINES_NUMBER > 1;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
6 rows affected.

[(1001, 2), (1003, 3), (1004, 2), (1006, 4), (1007, 2), (1008, 3)]

3. List all the vendors that do not provide any products (V_CODE. Use subqueries)

In [58]:
%%sql
select N.V_CODE, N.V_NAME from
(select V.V_CODE, V_NAME, P_CODE from VENDOR V
left join PRODUCT P
on V.V_CODE = P.V_CODE) N
where N.P_CODE = 0;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
3 rows affected.

[(21225, 'Bryson, Inc.'), (21231, 'D&E Supply'), (25595, 'Rubicon Systems')]

4. List details of the product that has the lowest price (P_PRICE).

In [6]:
%%sql
select * from PRODUCT
where P_PRICE in (select min(P_PRICE) from PRODUCT);

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
1 rows affected.

[('54778-2T', 'Rat-tail file, 1/8-in. fine', datetime.datetime(2013, 12, 15, 0, 0), 43, 20, Decimal('4.99'), Decimal('0.00'), 21344)]

5. Count the total number of products whose price is lower than the average product price. (P_PRICE)

In [12]:
%%sql
select count(*) as less_than_avg_price_count from PRODUCT
where P_PRICE < (select avg(P_PRICE) from PRODUCT);

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
1 rows affected.

[(11,)]

6. List the number of invoices generated by each customer, along with customer name. (Hint: group by CUS_CODE)

In [14]:
%%sql
select C.CUS_CODE, C.CUS_LNAME, C.CUS_FNAME, count(I.INV_NUMBER) as INVOICE_COUNT from CUSTOMER C
left join INVOICE I
on C.CUS_CODE = I.CUS_CODE
group by C.CUS_CODE;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
10 rows affected.

[(10010, 'Ramas', 'Alfred', 0),
 (10011, 'Dunne', 'Leona', 3),
 (10012, 'Smith', 'Kathy', 1),
 (10013, 'Olowski', 'Paul', 0),
 (10014, 'Orlando', 'Myron', 2),
 (10015, "O'Brian", 'Amy', 1),
 (10016, 'Brown', 'James', 0),
 (10017, 'Williams', 'George', 0),
 (10018, 'Farriss', 'Anne', 1),
 (10019, 'Smith', 'Olette', 0)]

7. List the total value of the product inventory. Use an appropriate ALIAS  (Hint: the value of each product is P_QOH*P_PRICE).

In [16]:
%%sql
select sum(P_QOH*P_PRICE) as TOTAL_INV_VALUE from PRODUCT;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
1 rows affected.

[(Decimal('15084.52'),)]

8. List the vendor information and its total product value.  Use an appropriate ALIAS (Hint: calculate the product value, then group by V_CODE).

In [21]:
%%sql
select V.*, sum(P.P_QOH*P.P_PRICE) as TOTAL_PRODUCT_VALUE from VENDOR V
left join PRODUCT P
on V.V_CODE = P.V_CODE
group by V.V_CODE;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
11 rows affected.

[(21225, 'Bryson, Inc.', 'Smithson', '615', '223-3234', 'TN', 'Y', Decimal('1431.13')),
 (21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N', None),
 (21231, 'D&E Supply', 'Singh', '615', '228-3245', 'TN', 'Y', Decimal('2002.65')),
 (21344, 'Gomez Bros.', 'Ortega', '615', '889-2546', 'KY', 'N', Decimal('1009.07')),
 (22567, 'Dome Supply', 'Smith', '901', '678-1419', 'GA', 'N', None),
 (23119, 'Randsets Ltd.', 'Anderson', '901', '678-3998', 'GA', 'Y', Decimal('1611.02')),
 (24004, 'Brackman Bros.', 'Browning', '615', '228-1410', 'TN', 'N', None),
 (24288, 'ORDVA, Inc.', 'Hakford', '615', '898-1234', 'TN', 'Y', Decimal('4305.47')),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N', None),
 (25501, 'Damal Supplies', 'Smythe', '615', '890-3529', 'TN', 'N', None),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y', Decimal('3506.42'))]

9. Modify the query used in the previous question to list the vendor whose total product value is greater than 2000.

In [25]:
%%sql
select V.*, sum(P.P_QOH*P.P_PRICE) as TOTAL_PRODUCT_VALUE from VENDOR V
left join PRODUCT P
on V.V_CODE = P.V_CODE
group by V.V_CODE
having TOTAL_PRODUCT_VALUE > 2000;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
3 rows affected.

[(21231, 'D&E Supply', 'Singh', '615', '228-3245', 'TN', 'Y', Decimal('2002.65')),
 (24288, 'ORDVA, Inc.', 'Hakford', '615', '898-1234', 'TN', 'Y', Decimal('4305.47')),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y', Decimal('3506.42'))]

10. List all vendors located in ‘FL’, and the products they supply. Note that it’s possible that the vendor does not supply any products and that vendor should also be listed.

In [27]:
%%sql
select V.*, P.P_CODE, P.P_DESCRIPT from VENDOR V
left join PRODUCT P
on V.V_CODE = P.V_CODE
where V.V_STATE = 'FL';

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
5 rows affected.

[(21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N', None, None),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N', None, None),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y', '11QER/31', 'Power painter, 15 psi., 3-nozzle'),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y', '2238/QPD', 'B&D cordless drill, 1/2-in.'),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y', 'WR3/TT3', 'Steel matting, 4\'x8\'x1/6", .5" mesh')]

11. Generate a listing of all purchases made by the customers, using the output shown in Figure 1 below as your guide. (Hint1: Multiple related tables need to be joined; Hint2: Use the ORDER BY clause to order the resulting rows as shown in Figure 1.)

In [35]:
%%sql
select C.CUS_CODE, I.INV_NUMBER, I.INV_DATE, P.P_DESCRIPT, L.LINE_UNITS, L.LINE_PRICE from CUSTOMER C
inner join INVOICE I on C.CUS_CODE = I.CUS_CODE
inner join LINE L on I.INV_NUMBER = L.INV_NUMBER
inner join PRODUCT P on L.P_CODE = P.P_CODE
order by C.CUS_CODE, I.INV_NUMBER, L.LINE_NUMBER;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
18 rows affected.

[(10011, 1002, datetime.datetime(2014, 1, 16, 1, 0), 'Rat-tail file, 1/8-in. fine', 2, Decimal('4.99')),
 (10011, 1004, datetime.datetime(2014, 1, 17, 0, 0), 'Rat-tail file, 1/8-in. fine', 3, Decimal('4.99')),
 (10011, 1004, datetime.datetime(2014, 1, 17, 0, 0), 'Claw hammer', 2, Decimal('9.95')),
 (10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'PVC pipe, 3.5-in., 8-ft', 5, Decimal('5.87')),
 (10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'Steel matting, 4\'x8\'x1/6", .5" mesh', 3, Decimal('119.95')),
 (10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), 'B&D cordless drill, 1/2-in.', 1, Decimal('38.95')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), 'Hrd. cloth, 1/4-in., 2x50', 1, Decimal('39.95')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), '7.25-in. pwr. saw blade', 5, Decimal('14.99')),
 (10014, 1001, datetime.datetime(2014, 1, 16, 0, 0), '7.25-in. pwr. saw blade', 1, Decimal('14.99')),
 (10014, 1001, datetime.datetime(2014, 1, 16, 0, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), '1.25-in. metal screw, 25', 3, Decimal('6.99')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'B&D jigsaw, 12-in. blade', 1, Decimal('109.92')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'Hicut chain saw, 16 in.', 1, Decimal('256.99')),
 (10015, 1007, datetime.datetime(2014, 1, 17, 2, 0), '7.25-in. pwr. saw blade', 2, Decimal('14.99')),
 (10015, 1007, datetime.datetime(2014, 1, 17, 2, 0), 'Rat-tail file, 1/8-in. fine', 1, Decimal('4.99')),
 (10018, 1005, datetime.datetime(2014, 1, 17, 1, 0), 'PVC pipe, 3.5-in., 8-ft', 12, Decimal('5.87'))]

In [39]:
%%sql
select * from INVOICE;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
8 rows affected.

[(1001, 10014, datetime.datetime(2014, 1, 16, 0, 0)),
 (1002, 10011, datetime.datetime(2014, 1, 16, 1, 0)),
 (1003, 10012, datetime.datetime(2014, 1, 16, 1, 0)),
 (1004, 10011, datetime.datetime(2014, 1, 17, 0, 0)),
 (1005, 10018, datetime.datetime(2014, 1, 17, 1, 0)),
 (1006, 10014, datetime.datetime(2014, 1, 17, 2, 0)),
 (1007, 10015, datetime.datetime(2014, 1, 17, 2, 0)),
 (1008, 10011, datetime.datetime(2014, 1, 17, 2, 0))]

In [53]:
%%sql
select * from LINE;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
18 rows affected.

[(1001, 1, '13-Q2/P2', 1, Decimal('14.99')),
 (1001, 2, '23109-HB', 1, Decimal('9.95')),
 (1002, 1, '54778-2T', 2, Decimal('4.99')),
 (1003, 1, '2238/QPD', 1, Decimal('38.95')),
 (1003, 2, '1546-QQ2', 1, Decimal('39.95')),
 (1003, 3, '13-Q2/P2', 5, Decimal('14.99')),
 (1004, 1, '54778-2T', 3, Decimal('4.99')),
 (1004, 2, '23109-HB', 2, Decimal('9.95')),
 (1005, 1, 'PVC23DRT', 12, Decimal('5.87')),
 (1006, 1, 'SM-18277', 3, Decimal('6.99')),
 (1006, 2, '2232/QTY', 1, Decimal('109.92')),
 (1006, 3, '23109-HB', 1, Decimal('9.95')),
 (1006, 4, '89-WRE-Q', 1, Decimal('256.99')),
 (1007, 1, '13-Q2/P2', 2, Decimal('14.99')),
 (1007, 2, '54778-2T', 1, Decimal('4.99')),
 (1008, 1, 'PVC23DRT', 5, Decimal('5.87')),
 (1008, 2, 'WR3/TT3', 3, Decimal('119.95')),
 (1008, 3, '23109-HB', 1, Decimal('9.95'))]

In [52]:
%%sql
select * from CUSTOMER;

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306/sales
10 rows affected.

[(10010, 'Ramas', 'Alfred', 'A', '615', '844-2573', 0.0),
 (10011, 'Dunne', 'Leona', 'K', '713', '894-1238', 0.0),
 (10012, 'Smith', 'Kathy', 'W', '615', '894-2285', 345.86),
 (10013, 'Olowski', 'Paul', 'F', '615', '894-2180', 536.75),
 (10014, 'Orlando', 'Myron', '', '615', '222-1672', 0.0),
 (10015, "O'Brian", 'Amy', 'B', '713', '442-3381', 0.0),
 (10016, 'Brown', 'James', 'G', '615', '297-1228', 221.19),
 (10017, 'Williams', 'George', '', '615', '290-2556', 768.93),
 (10018, 'Farriss', 'Anne', 'G', '713', '382-7185', 216.55),
 (10019, 'Smith', 'Olette', 'K', '615', '297-3809', 0.0)]